/* jshint esversion: 10 */
// just a fun thing for fun! lol!
const NAMESPACE_MODULE_CIULINATIONS_MC = "Ciulinations_Enchantment_Table";

window[NAMESPACE_MODULE_CIULINATIONS_MC] = {};
(function translation(exports) {
    var language = "mc";
    var author = "aubymori";

    const json = {
        global: {
            browse: "ʖ∷𝙹∴ᓭᒷ",
            upload: "⚍!¡ꖎ𝙹ᔑ↸",
            help: "⍑ᒷꖎ!¡",
            about: "ᔑʖ𝙹⚍ℸ",
            copyright: "ᓵ𝙹!¡||∷╎⊣⍑ℸ",
            advertising: "ᔑ↸⍊ᒷ∷ℸ╎ᓭ╎リ⊣",
            loading: "ꖎ𝙹ᔑ↸╎リ⊣...",
            channel: "ᓵ⍑ᔑリリᒷꖎ",
            seeall: "ᓭᒷᒷ ᔑꖎꖎ",
            search: "ᓭᒷᔑ∷ᓵ⍑"
        },
        stats: {
            likes: "ꖎ╎ꖌᒷᓭ",
            dislikes: "↸╎ᓭꖎ╎ꖌᒷᓭ"
        },
        buttons: {
            like: "ꖎ╎ꖌᒷ",
            addto: "ᔑ↸↸ ℸ𝙹",
            share: "ᓭ⍑ᔑ∷ᒷ",
            showmore: "ᓭ⍑𝙹∴ ᒲ𝙹∷ᒷ",
            showless: "ᓭ⍑𝙹∴ ꖎᒷᓭᓭ",
            subscribe: "ᓭ⚍ʖᓭᓵ∷╎ʖᒷ",
            subscribed: "ᓭ⚍ʖᓭᓵ∷╎ʖᒷ↸",
            unsubscribe: "⚍リᓭ⚍ʖᓭᓵ∷╎ʖᒷ",
            post: "!¡𝙹ᓭℸ"
        },
        comments: {
            charactersremain: "ᓵ⍑ᔑ∷ᔑᓵℸᒷ∷ᓭ ∷ᒷᒲᔑ╎リ╎リ⊣",
            secondsremain: "ᓭᒷᓵ𝙹リ↸ᓭ ∷ᒷᒲᔑ╎リ╎リ⊣ ʖᒷ⎓𝙹∷ᒷ ||𝙹⚍ ᓵᔑリ !¡𝙹ᓭℸ",
            loading: "ꖎ𝙹ᔑ↸╎リ⊣ ᓵ𝙹ᒲᒲᒷリℸ...",
            allcomments: "ᔑꖎꖎ ᓵ𝙹ᒲᒲᒷリℸᓭ",
            topcomments: "ℸ𝙹!¡ ᓵ𝙹ᒲᒲᒷリℸᓭ"
        },
        tooltip: {
            ilikethis: "╎ ꖎ╎ꖌᒷ ℸ⍑╎ᓭ",
            idislikethis: "╎ ↸╎ᓭꖎ╎ꖌᒷ ℸ⍑╎ᓭ",
            addto: "ᔑ↸↸ ℸ𝙹 ⎓ᔑ⍊𝙹∷╎ℸᒷᓭ 𝙹∷ !¡ꖎᔑ||ꖎ╎ᓭℸ",
            share: "ᓭ⍑ᔑ∷ᒷ 𝙹∷ ᒷᒲʖᒷ↸ ℸ⍑╎ᓭ ⍊╎↸ᒷ𝙹",
            flag: "⎓ꖎᔑ⊣ ᔑᓭ ╎リᔑ!¡!¡∷𝙹!¡∷╎ᔑℸᒷ",
            statistics: "ᓭ⍑𝙹∴ ⍊╎↸ᒷ𝙹 ᓭℸᔑℸ╎ᓭℸ╎ᓵᓭ",
            clicktobe: "ᓵꖎ╎ᓵꖌ ℸ𝙹 ʖᒷ リ𝙹ℸ╎⎓╎ᒷ↸ 𝙹⎓ リᒷ∴ ⍊╎↸ᒷ𝙹ᓭ ⎓∷𝙹ᒲ ℸ⍑╎ᓭ ᓵ⍑ᔑリリᒷꖎ"
        },
        player: {
            mute: "ᒲ⚍ℸᒷ",
            unmute: "⚍リᒲ⚍ℸᒷ",
            quality: "ᓵ⍑ᔑリ⊣ᒷ ᑑ⚍ᔑꖎ╎ℸ||",
            fullscreen: "⎓⚍ꖎꖎ ᓭᓵ∷ᒷᒷリ"
        },
        watch: {
            by: "ʖ||",
            tags: "ℸᔑ⊣ᓭ",
            on: "𝙹リ",
            license: "ꖎ╎ᓵᒷリᓭᒷ",
            uploadby: "⚍!¡ꖎ𝙹ᔑ↸ᒷ↸ ʖ||",
            category: "ᓵᔑℸᒷ⊣𝙹∷||",
            from: "⎓∷𝙹ᒲ:",
            uploadedavideo: "⚍!¡ꖎ𝙹ᔑ↸ᒷ↸ ᔑ ⍊╎↸ᒷ𝙹",
            islive: "╎ᓭ ꖎ╎⍊ᒷ"
        },
        about: {
            country: "ᓵ𝙹⚍リℸ∷||:",
            membersince: "⋮𝙹╎リᒷ↸:",
            viewedcounts: "⍊╎ᒷ∴ᓭ:",
            viewedcount: "⍊╎ᒷ∴:",
            sub: "ᓭ⚍ʖᓭᓵ∷╎ʖᒷ∷:",
            subs: "ᓭ⚍ʖᓭᓵ∷╎ʖᒷ∷ᓭ:"
        },
        customtag: {
            age: "ᔑ⊣ᒷ",
            occupation: "𝙹ᓵᓵ⚍!¡ᔑℸ╎𝙹リ"
        },
        personal: {
            mychannel: "ᒲ|| ᓵ⍑ᔑリリᒷꖎ",
            videos: "⍊╎↸ᒷ𝙹ᓭ",
            likes: "ꖎ╎ꖌᒷᓭ",
            history: "⍑╎ᓭℸ𝙹∷||",
            watchlater: "∴ᔑℸᓵ⍑ ꖎᔑℸᒷ∷",
            videomanager: "⍊╎↸ᒷ𝙹 ᒲᔑリᔑ⊣ᒷ∷",
            settings: "YouTube ᓭᒷℸℸ╎リ⊣ᓭ",
            subscriptions: "ᓭ⚍ʖᓭᓵ∷╎!¡ℸ╎𝙹リᓭ"
        },
        browse: {
            mostviewed: "ᒲ𝙹ᓭℸ ⍊╎ᒷ∴ᒷ↸ ℸ𝙹↸ᔑ||",
            recommended: "∷ᒷᓵ𝙹ᒲᒲᒷリ↸ᒷ↸ ⎓𝙹∷ ||𝙹⚍"
        },
        guide: {
            fromyt: "⎓∷𝙹ᒲ YouTube",
            trending: "ℸ∷ᒷリ↸╎リ⊣",
            popular: "!¡𝙹!¡⚍ꖎᔑ∷",
            music: "ᒲ⚍ᓭ╎ᓵ",
            live: "ꖎ╎⍊ᒷ",
            gaming: "⊣ᔑᒲ╎リ⊣",
            news: "リᒷ∴ᓭ",
            sports: "ᓭ!¡𝙹∷ℸᓭ",
            education: "ᒷ↸⚍ᓵᔑℸ╎𝙹リ",
            howto: "⍑𝙹∴ℸ𝙹 & ᓭℸ||ꖎᒷ"
        }
    };
    
    Ciulinations.addTranslation(language, json, author);
})(NAMESPACE_MODULE_CIULINATIONS_MC);